transaction-manager/transaction-manager-component-test/src/test/resources/data/request/childSubscription/ChildSubscriptionKafkaTransactionMessage.json

{
  "additionalInfo": {
    "REQUEST_ID": "ecfc6c00-3cab-11e8-98d3-7f99b9a03939",
    "TRANSACTION_STATUS": "COMPLETE",
    "x-b3-traceid": "5c41b539181035048daf8df39b94f2fd",
    "l5d-test": "test123"
  },
  "header": {
    "type": "CHILD_SUBSCRIPTION_TRANSFER",
    "url": ""
  },
  "messages": [
    {
      "additionalInfo": {
        "PARTY_KEY": "102",
        "PAYMENT_METHOD_TYPE": "CHILD_SUBSCRIPTION_TRANSFER",
        "PRODUCT_KEY": "703",
        "SUBSCRIPTION_KEY": "27c5b516-5aea-540d-adec-59cb56c6f637",
        "TRANSACTION_CODE": "PMNT.MDOP.INPL"
      },
      "message": {
        "BASE_CURRENCY_CODE": "GBP",
        "DEBTOR_ACCOUNT_NUMBER": "4568904",
        "DEBTOR_SORT_CODE": "12345578",
        "INSTRUCTED_AMOUNT": "10",
        "TRANSACTION_DATE": "2018-05-11T13:14:30.893+0000",
        "VALUE_DATE_TIME": "2018-05-11T13:14:30.893+0000"
      },
      "type": "PAIN001"
    },
    {
      "additionalInfo": {
        "PARTY_KEY": "103",
        "PAYMENT_METHOD_TYPE": "CHILD_SUBSCRIPTION_TRANSFER",
        "PRODUCT_KEY": "704",
        "SUBSCRIPTION_KEY": "27c5b516-5aea-540d-adec-59cb56c6f637",
        "TRANSACTION_CODE": "PMNT.MCOP.INPL"
      },
      "message": {
        "BASE_CURRENCY_CODE": "GBP",
        "CREDITOR_ACCOUNT_NUMBER": "87798989",
        "CREDITOR_SORT_CODE": "12345678",
        "INSTRUCTED_AMOUNT": "10",
        "TRANSACTION_DATE": "2018-05-11T13:14:30.893+0000",
        "VALUE_DATE_TIME": "2018-05-11T13:14:30.893+0000"
      },
      "type": "PACS008"
    }
  ]
}